espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
/***************************************************************************//**
 * @brief Mesh generic model data serialization/deserialization functions
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include <stdint.h>
#include <stdlib.h>
#include <errno.h>
#include <string.h>

#include "sl_btmesh_capi_types.h"
#include "sl_btmesh_generic_model_capi_types.h"
#include "sl_btmesh_serdeser.h"

static int16_t int16_from_buf(const uint8_t *ptr)
{
  return ((int16_t)ptr[0]) | ((int16_t)ptr[1] << 8);
}

static void int16_to_buf(uint8_t *ptr, int16_t n)
{
  ptr[0] = n & 0xff;
  ptr[1] = (n >> 8) & 0xff;
}

static uint16_t uint16_from_buf(const uint8_t *ptr)
{
  return ((uint16_t)ptr[0]) | ((uint16_t)ptr[1] << 8);
}

static void uint16_to_buf(uint8_t *ptr, uint16_t n)
{
  ptr[0] = n & 0xff;
  ptr[1] = (n >> 8) & 0xff;
}

static int32_t int32_from_buf(const uint8_t *ptr)
{
  return
    ((int32_t)ptr[0])
    | ((int32_t)ptr[1] << 8)
    | ((int32_t)ptr[2] << 16)
    | ((int32_t)ptr[3] << 24)
  ;
}

static void int32_to_buf(uint8_t *ptr, int32_t n)
{
  ptr[0] = n & 0xff;
  ptr[1] = (n >> 8) & 0xff;
  ptr[2] = (n >> 16) & 0xff;
  ptr[3] = (n >> 24) & 0xff;
}

sl_status_t mesh_lib_serialize_request(const struct mesh_generic_request *req,
                                       uint8_t *msg_buf,
                                       size_t msg_len,
                                       size_t *msg_used)
{
  size_t msg_off = 0;

  switch (req->kind) {
    case mesh_generic_request_on_off:
      if (msg_len < 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = req->on_off;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_on_power_up:
      if (msg_len < 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = req->on_power_up;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_transition_time:
      if (msg_len < 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = req->transition_time;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_level:
    case mesh_generic_request_level_move:
    case mesh_generic_request_level_halt:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int16_to_buf(&msg_buf[msg_off], req->level);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_level_delta:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int32_to_buf(&msg_buf[msg_off], req->delta);
      msg_off += 4;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_location_global:
      if (msg_len < 10) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int32_to_buf(&msg_buf[msg_off], req->location_global.lat);
      msg_off += 4;
      int32_to_buf(&msg_buf[msg_off], req->location_global.lon);
      msg_off += 4;
      int16_to_buf(&msg_buf[msg_off], req->location_global.alt);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_location_local:
      if (msg_len < 9) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int16_to_buf(&msg_buf[msg_off], req->location_local.north);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], req->location_local.east);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], req->location_local.alt);
      msg_off += 2;
      msg_buf[msg_off++] = req->location_local.floor;
      uint16_to_buf(&msg_buf[msg_off], req->location_local.uncertainty);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_power_level:
    case mesh_generic_request_power_level_default:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->power_level);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_power_level_range:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->power_range[0]);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->power_range[1]);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_property_user:
      if (msg_len < 2 + (size_t)req->property.length) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->property.id);
      msg_off += 2;
      memcpy(msg_buf + msg_off,
             req->property.buffer + req->property.offset,
             req->property.length);
      msg_off += req->property.length;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_property_admin:
      if (msg_len < 3 + (size_t)req->property.length) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->property.id);
      msg_off += 2;
      msg_buf[msg_off++] = req->property.access;
      memcpy(msg_buf + msg_off,
             req->property.buffer + req->property.offset,
             req->property.length);
      msg_off += req->property.length;
      *msg_used = msg_off;
      break;

    case mesh_generic_request_property_manuf:
      if (msg_len < 3) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->property.id);
      msg_off += 2;
      msg_buf[msg_off++] = req->property.access;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_lightness_actual:
    case mesh_lighting_request_lightness_linear:
    case mesh_lighting_request_lightness_default:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->lightness);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_lightness_range:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->lightness_range.min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->lightness_range.max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_ctl:
    case mesh_lighting_request_ctl_default:
      if (msg_len < 6) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->ctl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->ctl.temperature);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], req->ctl.deltauv);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_ctl_temperature:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->ctl_temperature.temperature);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], req->ctl_temperature.deltauv);
      msg_off += 2;
      *msg_used = msg_off;
      break;

