espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
    case mesh_lighting_request_ctl_temperature_range:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], req->ctl_temperature_range.min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->ctl_temperature_range.max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_hsl:
    case mesh_lighting_request_hsl_default:
      if (msg_len < 6) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], req->hsl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->hsl.hue);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->hsl.saturation);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_hsl_hue:
      if (msg_len < 2) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], req->hsl_hue);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_hsl_saturation:
      if (msg_len < 2) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], req->hsl_saturation);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_request_hsl_range:
      if (msg_len < 8) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], req->hsl_range.hue_min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->hsl_range.hue_max);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->hsl_range.saturation_min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], req->hsl_range.saturation_max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

sl_status_t mesh_lib_deserialize_request(struct mesh_generic_request *req,
                                         mesh_generic_request_t kind,
                                         const uint8_t *msg_buf,
                                         size_t msg_len)
{
  size_t msg_off = 0;

  switch (kind) {
    case mesh_generic_request_on_off:
      if (msg_len - msg_off != 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->on_off = msg_buf[msg_off];
      break;

    case mesh_generic_request_on_power_up:
      if (msg_len - msg_off != 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->on_power_up = msg_buf[msg_off];
      break;

    case mesh_generic_request_transition_time:
      if (msg_len - msg_off != 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->transition_time = msg_buf[msg_off];
      break;

    case mesh_generic_request_level:
    case mesh_generic_request_level_move:
    case mesh_generic_request_level_halt:
      if (msg_len - msg_off != 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->level = int16_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_generic_request_level_delta:
      if (msg_len - msg_off != 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->delta = int32_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_generic_request_location_global:
      if (msg_len - msg_off != 10) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->location_global.lat = int32_from_buf(&msg_buf[msg_off]);
      msg_off += 4;
      req->location_global.lon = int32_from_buf(&msg_buf[msg_off]);
      msg_off += 4;
      req->location_global.alt = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      break;

    case mesh_generic_request_location_local:
      if (msg_len - msg_off != 9) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->location_local.north = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->location_local.east = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->location_local.alt = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->location_local.floor = msg_buf[msg_off++];
      req->location_local.uncertainty = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      break;

    case mesh_generic_request_power_level:
    case mesh_generic_request_power_level_default:
      if (msg_len - msg_off != 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->power_level = uint16_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_generic_request_power_level_range:
      if (msg_len - msg_off != 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->power_range[0] = uint16_from_buf(&msg_buf[msg_off]);
      req->power_range[1] = uint16_from_buf(&msg_buf[msg_off + 2]);
      break;

    case mesh_generic_request_property_user:
      if (msg_len - msg_off < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->property.id = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->property.buffer = msg_buf;
      req->property.offset = msg_off;
      req->property.length = msg_len - msg_off;
      break;

    case mesh_generic_request_property_admin:
      if (msg_len - msg_off < 3) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->property.id = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->property.access = msg_buf[msg_off++];
      req->property.buffer = msg_buf;
      req->property.offset = msg_off;
      req->property.length = msg_len - msg_off;
      break;

    case mesh_generic_request_property_manuf:
      if (msg_len - msg_off != 3) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->property.id = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      req->property.access = msg_buf[msg_off++];
      req->property.buffer = NULL;
      req->property.offset = 0;
      req->property.length = 0;
      break;

    case mesh_lighting_request_lightness_actual:
    case mesh_lighting_request_lightness_linear:
    case mesh_lighting_request_lightness_default:
      if (msg_len - msg_off != 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->lightness = uint16_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_lighting_request_lightness_range:
      if (msg_len - msg_off != 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->lightness_range.min = uint16_from_buf(&msg_buf[msg_off]);
      req->lightness_range.max = uint16_from_buf(&msg_buf[msg_off + 2]);
      break;

    case mesh_lighting_request_ctl:
    case mesh_lighting_request_ctl_default:
      if (msg_len - msg_off != 6) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->ctl.lightness = uint16_from_buf(&msg_buf[msg_off]);
      req->ctl.temperature = uint16_from_buf(&msg_buf[msg_off + 2]);
      req->ctl.deltauv = int16_from_buf(&msg_buf[msg_off + 4]);
      break;

    case mesh_lighting_request_ctl_temperature:
      if (msg_len - msg_off != 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->ctl_temperature.temperature = uint16_from_buf(&msg_buf[msg_off]);
      req->ctl_temperature.deltauv = int16_from_buf(&msg_buf[msg_off + 2]);
      break;

