espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
    case mesh_lighting_request_ctl_temperature_range:
      if (msg_len - msg_off != 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      req->kind = kind;
      req->ctl_temperature_range.min = uint16_from_buf(&msg_buf[msg_off]);
      req->ctl_temperature_range.max = uint16_from_buf(&msg_buf[msg_off + 2]);
      break;

    case mesh_lighting_request_hsl:
    case mesh_lighting_request_hsl_default:
      if (msg_len - msg_off != 6) {
        return -1;
      }
      req->kind = kind;
      req->hsl.lightness = uint16_from_buf(&msg_buf[msg_off + 0]);
      req->hsl.hue = uint16_from_buf(&msg_buf[msg_off + 2]);
      req->hsl.saturation = uint16_from_buf(&msg_buf[msg_off + 4]);
      break;

    case mesh_lighting_request_hsl_hue:
      if (msg_len - msg_off != 2) {
        return -1;
      }
      req->kind = kind;
      req->hsl_hue = uint16_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_lighting_request_hsl_saturation:
      if (msg_len - msg_off != 2) {
        return -1;
      }
      req->kind = kind;
      req->hsl_saturation = uint16_from_buf(&msg_buf[msg_off]);
      break;

    case mesh_lighting_request_hsl_range:
      if (msg_len - msg_off != 8) {
        return -1;
      }
      req->kind = kind;
      req->hsl_range.hue_min = uint16_from_buf(&msg_buf[msg_off]);
      req->hsl_range.hue_max = uint16_from_buf(&msg_buf[msg_off + 2]);
      req->hsl_range.saturation_min = uint16_from_buf(&msg_buf[msg_off + 4]);
      req->hsl_range.saturation_max = uint16_from_buf(&msg_buf[msg_off + 6]);
      break;

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

sl_status_t mesh_lib_serialize_state(const struct mesh_generic_state *current,
                                     const struct mesh_generic_state *target,
                                     uint8_t *msg_buf,
                                     size_t msg_len,
                                     size_t *msg_used)
{
  size_t msg_off = 0;

  switch (current->kind) {
    case mesh_generic_state_on_off:
      if (msg_len < (target ? 2 : 1)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->on_off.on;
      if (target) {
        msg_buf[msg_off++] = target->on_off.on;
      }
      *msg_used = msg_off;
      break;

    case mesh_generic_state_on_power_up:
      if (msg_len < 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->on_power_up.on_power_up;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_transition_time:
      if (msg_len < 1) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->transition_time.time;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_level:
      if (msg_len < (target ? 4 : 2)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int16_to_buf(&msg_buf[msg_off], current->level.level);
      msg_off += 2;
      if (target) {
        int16_to_buf(&msg_buf[msg_off], target->level.level);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_generic_state_location_global:
      if (msg_len < 10) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int32_to_buf(&msg_buf[msg_off], current->location_global.lat);
      msg_off += 4;
      int32_to_buf(&msg_buf[msg_off], current->location_global.lon);
      msg_off += 4;
      int16_to_buf(&msg_buf[msg_off], current->location_global.alt);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_location_local:
      if (msg_len < 9) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      int16_to_buf(&msg_buf[msg_off], current->location_local.north);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], current->location_local.east);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], current->location_local.alt);
      msg_off += 2;
      msg_buf[msg_off++] = current->location_local.floor;
      uint16_to_buf(&msg_buf[msg_off], current->location_local.uncertainty);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_battery:
      if (msg_len < 8) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->battery.level;
      memcpy(msg_buf + msg_off, current->battery.discharge_time, 3);
      msg_off += 3;
      memcpy(msg_buf + msg_off, current->battery.charge_time, 3);
      msg_off += 3;
      msg_buf[msg_off++] = current->battery.flags;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_power_level:
      if (msg_len < (target ? 4 : 2)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->power_level.level);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->power_level.level);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_generic_state_power_level_last:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->power_level_last.level);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_power_level_default:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->power_level_default.level);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_power_level_range:
      if (msg_len < 5) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->power_level_range.status;
      uint16_to_buf(&msg_buf[msg_off], current->power_level_range.min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->power_level_range.max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_property_user:
    case mesh_generic_state_property_admin:
    case mesh_generic_state_property_manuf:
      if (msg_len < 3 + (size_t)current->property.length) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->property.id);
      msg_off += 2;
      msg_buf[msg_off++] = current->property.access;
      memcpy(msg_buf + msg_off,
             current->property.buffer + current->property.offset,
             current->property.length);
      msg_off += current->property.length;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_property_list_user:
    case mesh_generic_state_property_list_admin:
    case mesh_generic_state_property_list_manuf:
    case mesh_generic_state_property_list_client:
      if (msg_len < current->property_list.length) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      memcpy(msg_buf + msg_off,
             current->property_list.buffer + current->property_list.offset,
             current->property_list.length);
      msg_off += current->property_list.length;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_lightness_actual:
    case mesh_lighting_state_lightness_linear:
      if (msg_len < (target ? 4 : 2)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->lightness.level);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->lightness.level);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_lightness_last:
    case mesh_lighting_state_lightness_default:
      if (msg_len < 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->lightness.level);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_lightness_range_with_status:
      if (msg_len < 5) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->lightness_range.status;
    //Intentional fallthrough
    case mesh_lighting_state_lightness_range:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->lightness_range.min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->lightness_range.max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_ctl:
      if (msg_len < (target ? 12 : 6)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->ctl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->ctl.temperature);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], current->ctl.deltauv);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->ctl.lightness);
        msg_off += 2;
        uint16_to_buf(&msg_buf[msg_off], target->ctl.temperature);
        msg_off += 2;
        int16_to_buf(&msg_buf[msg_off], target->ctl.deltauv);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

