espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
    case mesh_lighting_state_ctl_temperature:
      if (msg_len < (target ? 8 : 4)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->ctl_temperature.temperature);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], current->ctl_temperature.deltauv);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->ctl_temperature.temperature);
        msg_off += 2;
        int16_to_buf(&msg_buf[msg_off], target->ctl_temperature.deltauv);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_ctl_lightness_temperature:
      if (msg_len < (target ? 8 : 4)) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->ctl_lightness_temperature.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->ctl_lightness_temperature.temperature);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->ctl_lightness_temperature.lightness);
        msg_off += 2;
        uint16_to_buf(&msg_buf[msg_off], target->ctl_lightness_temperature.temperature);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_ctl_default:
      if (msg_len < 6) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->ctl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->ctl.temperature);
      msg_off += 2;
      int16_to_buf(&msg_buf[msg_off], current->ctl.deltauv);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_ctl_temperature_range_with_status:
      if (msg_len < 5) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      msg_buf[msg_off++] = current->ctl_temperature_range.status;
    //Intentional fallthrough
    case mesh_lighting_state_ctl_temperature_range:
      if (msg_len < 4) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      uint16_to_buf(&msg_buf[msg_off], current->ctl_temperature_range.min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->ctl_temperature_range.max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_hsl:
      if (msg_len < (target ? 12 : 6)) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], current->hsl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl.hue);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl.saturation);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->hsl.lightness);
        msg_off += 2;
        uint16_to_buf(&msg_buf[msg_off], target->hsl.hue);
        msg_off += 2;
        uint16_to_buf(&msg_buf[msg_off], target->hsl.saturation);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_hsl_target:
    case mesh_lighting_state_hsl_default:
      if (msg_len < 6) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], current->hsl.lightness);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl.hue);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl.saturation);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_hsl_hue:
      if (msg_len < (target ? 4 : 2)) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], current->hsl_hue.hue);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->hsl_hue.hue);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_hsl_saturation:
      if (msg_len < (target ? 4 : 2)) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], current->hsl_saturation.saturation);
      msg_off += 2;
      if (target) {
        uint16_to_buf(&msg_buf[msg_off], target->hsl_saturation.saturation);
        msg_off += 2;
      }
      *msg_used = msg_off;
      break;

    case mesh_lighting_state_hsl_range_with_status:
      if (msg_len < 9) {
        return -1;
      }
      msg_buf[msg_off++] = current->hsl_range.status;
    //Intentional fallthrough
    case mesh_lighting_state_hsl_range:
      if (msg_len < 8) {
        return -1;
      }
      uint16_to_buf(&msg_buf[msg_off], current->hsl_range.hue_min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl_range.hue_max);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl_range.saturation_min);
      msg_off += 2;
      uint16_to_buf(&msg_buf[msg_off], current->hsl_range.saturation_max);
      msg_off += 2;
      *msg_used = msg_off;
      break;

    case mesh_generic_state_last:
    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

sl_status_t mesh_lib_deserialize_state(struct mesh_generic_state *current,
                                       struct mesh_generic_state *target,
                                       int *has_target,
                                       mesh_generic_state_t kind,
                                       const uint8_t *msg_buf,
                                       size_t msg_len)
{
  size_t msg_off = 0;

  switch (kind) {
    case mesh_generic_state_on_off:
      if (msg_len - msg_off == 1) {
        current->kind = kind;
        current->on_off.on = msg_buf[msg_off++];
        *has_target = 0;
      } else if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->on_off.on = msg_buf[msg_off++];
        target->kind = kind;
        target->on_off.on = msg_buf[msg_off++];
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_generic_state_on_power_up:
      if (msg_len - msg_off == 1) {
        current->kind = kind;
        current->on_power_up.on_power_up = msg_buf[msg_off++];
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_generic_state_transition_time:
      if (msg_len - msg_off == 1) {
        current->kind = kind;
        current->transition_time.time = msg_buf[msg_off++];
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_generic_state_level:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->level.level = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->level.level = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->level.level = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_generic_state_location_global:
      if (msg_len - msg_off != 10) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->location_global.lat = int32_from_buf(&msg_buf[msg_off]);
      msg_off += 4;
      current->location_global.lon = int32_from_buf(&msg_buf[msg_off]);
      msg_off += 4;
      current->location_global.alt = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      *has_target = 0;
      break;

    case mesh_generic_state_location_local:
      if (msg_len - msg_off != 9) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->location_local.north = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      current->location_local.east = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      current->location_local.alt = int16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      current->location_local.floor = msg_buf[msg_off++];
      current->location_local.uncertainty = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      *has_target = 0;
      break;

    case mesh_generic_state_battery:
      if (msg_len - msg_off != 8) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->battery.level = msg_buf[msg_off++];
      memcpy(current->battery.discharge_time, msg_buf + msg_off, 3);
      msg_off += 3;
      memcpy(current->battery.charge_time, msg_buf + msg_off, 3);
      msg_off += 3;
      current->battery.flags = msg_buf[msg_off++];
      *has_target = 0;
      break;

    case mesh_generic_state_power_level:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->power_level.level = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->power_level.level = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->power_level.level = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

