espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
    case mesh_generic_state_power_level_last:
      if (msg_len - msg_off != 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->power_level_last.level = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      *has_target = 0;
      break;

    case mesh_generic_state_power_level_default:
      if (msg_len - msg_off != 2) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->power_level_default.level = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      *has_target = 0;
      break;

    case mesh_generic_state_power_level_range:
      if (msg_len - msg_off != 5) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->power_level_range.status = msg_buf[msg_off++];
      current->power_level_range.min = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      current->power_level_range.max = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      *has_target = 0;
      break;

    case mesh_generic_state_property_user:
    case mesh_generic_state_property_admin:
    case mesh_generic_state_property_manuf:
      if (msg_len - msg_off < 3) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->property.id = uint16_from_buf(&msg_buf[msg_off]);
      msg_off += 2;
      current->property.access = msg_buf[msg_off++];
      current->property.buffer = msg_buf;
      current->property.offset = msg_off;
      current->property.length = msg_len - msg_off;
      *has_target = 0;
      break;

    case mesh_generic_state_property_list_user:
    case mesh_generic_state_property_list_admin:
    case mesh_generic_state_property_list_manuf:
    case mesh_generic_state_property_list_client:
      if ((msg_len - msg_off) & 0x01) {
        return SL_STATUS_INVALID_PARAMETER;
      }
      current->kind = kind;
      current->property_list.buffer = msg_buf;
      current->property_list.offset = msg_off;
      current->property_list.length = msg_len - msg_off;
      *has_target = 0;
      break;

    case mesh_lighting_state_lightness_actual:
    case mesh_lighting_state_lightness_linear:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->lightness.level = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->lightness.level = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->lightness.level = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_lightness_last:
    case mesh_lighting_state_lightness_default:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->lightness.level = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_lightness_range_with_status:
      if (msg_len - msg_off == 5) {
        current->lightness_range.status = msg_buf[msg_off++];
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
    //Intentional fallthrough
    case mesh_lighting_state_lightness_range:
      if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->lightness_range.min = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->lightness_range.max = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_ctl:
      if (msg_len - msg_off == 6) {
        current->kind = kind;
        current->ctl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 12) {
        current->kind = kind;
        current->ctl.lightness = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->ctl.lightness = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->ctl.temperature = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->ctl.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_ctl_temperature:
      if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->ctl_temperature.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl_temperature.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 8) {
        current->kind = kind;
        current->ctl_temperature.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl_temperature.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->ctl_temperature.temperature = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->ctl_temperature.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_ctl_lightness_temperature:
      if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->ctl_lightness_temperature.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl_lightness_temperature.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 8) {
        current->kind = kind;
        current->ctl_lightness_temperature.lightness = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl_lightness_temperature.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->kind = kind;
        target->ctl_lightness_temperature.lightness = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->ctl_lightness_temperature.temperature = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_ctl_default:
      if (msg_len - msg_off == 6) {
        current->kind = kind;
        current->ctl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.temperature = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl.deltauv = int16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

