espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/src/sl_btmesh_serdeser.c
    case mesh_lighting_state_ctl_temperature_range_with_status:
      if (msg_len - msg_off == 5) {
        current->ctl_temperature_range.status = msg_buf[msg_off++];
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
    // Intentional fallthrough
    case mesh_lighting_state_ctl_temperature_range:
      if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->ctl_temperature_range.min = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->ctl_temperature_range.max = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case mesh_lighting_state_hsl:
      if (msg_len - msg_off == 6) {
        current->kind = kind;
        current->hsl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 12) {
        current->kind = kind;
        current->hsl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->hsl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->hsl.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->hsl.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return -1;
      }
      break;

    case mesh_lighting_state_hsl_target:
    case mesh_lighting_state_hsl_default:
      if (msg_len - msg_off == 6) {
        current->kind = kind;
        current->hsl.lightness = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return -1;
      }
      break;

    case mesh_lighting_state_hsl_hue:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->hsl_hue.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->hsl_hue.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->hsl_hue.hue = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return -1;
      }
      break;

    case mesh_lighting_state_hsl_saturation:
      if (msg_len - msg_off == 2) {
        current->kind = kind;
        current->hsl_saturation.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else if (msg_len - msg_off == 4) {
        current->kind = kind;
        current->hsl_saturation.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        target->hsl_saturation.saturation = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 1;
      } else {
        return -1;
      }
      break;

    case mesh_lighting_state_hsl_range_with_status:
      if (msg_len - msg_off == 9) {
        current->hsl_range.status = msg_buf[msg_off++];
      } else {
        return -1;
      }
    // Intentional fallthrough
    case mesh_lighting_state_hsl_range:
      if (msg_len - msg_off == 8) {
        current->kind = kind;
        current->hsl_range.hue_min = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl_range.hue_max = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl_range.saturation_min = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        current->hsl_range.saturation_max = uint16_from_buf(&msg_buf[msg_off]);
        msg_off += 2;
        *has_target = 0;
      } else {
        return -1;
      }
      break;

    case mesh_generic_state_last:
    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}
